
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       3 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                    |
|:--------:|:-----------------------------------------------------------------------------|
|    🟢     | `module.repos["terraform-aws-ecs"].github_actions_secret.secret["GH_TOKEN"]` |
|    🟢     | `module.repos["terraform-aws-ecs"].github_repository.repo`                   |
|    🟢     | `module.repos["terraform-aws-ecs"].github_team_repository.dev`               |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/7a2300a9-087f-4d86-bfcd-e771c6828c60/terraform-bin plan -no-color --out=tf.plan
data.external.env: Reading...
module.infrahouse8-github-control.module.state-bucket.random_pet.suffix: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]
data.external.env: Read complete after 0s [id=-]
module.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]
module.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]
github_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]
github_team.dev: Refreshing state... [id=7332815]
github_organization_settings.infrahouse: Refreshing state... [id=121984263]
module.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]
github_team_members.dev: Refreshing state... [id=7332815]
module.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]
module.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]
module.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]
module.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]
module.infrahouse8-github-control.module.state-bucket.aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]
data.aws_secretsmanager_secrets.gh_secrets: Reading...
data.aws_ssm_parameter.gh_secrets_namespace: Reading...
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Reading...
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Reading...
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Reading...
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=2229426295]
module.infrahouse8-github-control.module.gha-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-github-control-github]
data.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]
module.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]
data.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Reading...
github_actions_variable.role_github: Refreshing state... [id=github-control:role_github]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Reading...
module.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=262017685]
aws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Read complete after 0s [id=91398067]
aws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-github-control-state-manager]
module.infrahouse8-github-control.module.gha-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-github-control-admin]
github_actions_variable.dynamodb_lock_table_name: Refreshing state... [id=github-control:dynamodb_lock_table_name]
module.infrahouse8-github-control.module.state-bucket.aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-control-state]
github_actions_variable.role_admin: Refreshing state... [id=github-control:role_admin]
data.aws_secretsmanager_secret_version.pypi_api_token: Reading...
data.aws_secretsmanager_secret_version.codacy_api_token: Reading...
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Reading...
github_actions_variable.role_state_manager: Refreshing state... [id=github-control:role_state_manager]
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2246898652]
module.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-github-control-github20231016152934873800000001]
data.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]
data.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]
module.repos["infrahouse-com"].github_repository.repo: Refreshing state... [id=infrahouse-com]
module.repos["terraform-aws-ci-cd"].github_repository.repo: Refreshing state... [id=terraform-aws-ci-cd]
module.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]
module.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]
module.repos["terraform-aws-state-manager"].github_repository.repo: Refreshing state... [id=terraform-aws-state-manager]
module.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]
module.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]
module.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]
module.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]
module.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]
module.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]
module.repos["terraform-aws-jumphost"].github_repository.repo: Refreshing state... [id=terraform-aws-jumphost]
module.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]
module.repos["infrahouse-puppet-data"].github_repository.repo: Refreshing state... [id=infrahouse-puppet-data]
module.repos["terraform-aws-github-role"].github_repository.repo: Refreshing state... [id=terraform-aws-github-role]
module.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]
module.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]
module.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]
module.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]
module.repos["terraform-aws-state-bucket"].github_repository.repo: Refreshing state... [id=terraform-aws-state-bucket]
module.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]
module.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]
module.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]
module.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-github-control-github-20231016152935026000000003]
module.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-github-control-admin-20231016152934892800000002]
module.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-control-state]
module.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-control-state]
module.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-control-state]
github_actions_variable.state_bucket: Refreshing state... [id=github-control:state_bucket]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3098380055]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=19153250]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-ro20231016152936860000000001]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-rw20231016152936864600000002]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152936987100000003]
module.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152937028600000004]
module.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]
module.repos["terraform-aws-github-role"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-github-role]
module.repos["infrahouse-com"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-com]
module.repos["infrahouse-puppet-data"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-puppet-data]
module.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]
module.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]
module.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]
module.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]
module.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]
module.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]
module.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]
module.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]
module.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]
module.repos["terraform-aws-ci-cd"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-ci-cd]
module.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]
module.repos["terraform-aws-jumphost"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-jumphost]
module.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]
module.repos["terraform-aws-state-bucket"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-bucket]
module.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]
module.repos["terraform-aws-state-manager"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-manager]
module.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]
module.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]
module.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]
module.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]
module.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]
module.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]
module.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]
module.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-com:GH_TOKEN]
module.repos["terraform-aws-github-role"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-github-role:GH_TOKEN]
module.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]
module.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]
module.repos["infrahouse-puppet-data"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-puppet-data:GH_TOKEN]
module.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]
module.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]
module.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]
module.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]
module.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]
module.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]
module.repos["infrahouse-com"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-com:AWS_DEFAULT_REGION]
module.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]
module.repos["terraform-aws-state-bucket"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-bucket:GH_TOKEN]
module.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-manager:GH_TOKEN]
module.repos["terraform-aws-ci-cd"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-ci-cd:GH_TOKEN]
module.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]
module.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]
module.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]
module.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]
module.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]
module.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]
module.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]
module.repos["infrahouse-puppet-data"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-puppet-data:AWS_DEFAULT_REGION]
module.repos["terraform-aws-jumphost"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-jumphost:GH_TOKEN]
module.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos["terraform-aws-ecs"].github_actions_secret.secret["GH_TOKEN"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "terraform-aws-ecs"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.repos["terraform-aws-ecs"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Module that runs service in ECS"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-aws-ecs"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
    }

  # module.repos["terraform-aws-ecs"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "terraform-aws-ecs"
      + team_id    = "7332815"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.external.env: Reading...%0Amodule.infrahouse8-github-control.module.state-bucket.random_pet.suffix: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]%0Adata.external.env: Read complete after 0s [id=-]%0Amodule.ih8_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Amodule.ih_8_repos["github-control"].github_repository.repo: Refreshing state... [id=github-control]%0Agithub_membership.infrahouse["akuzminsky"]: Refreshing state... [id=infrahouse:akuzminsky]%0Agithub_team.dev: Refreshing state... [id=7332815]%0Agithub_organization_settings.infrahouse: Refreshing state... [id=121984263]%0Amodule.ih_tf_template.github_repository.repo: Refreshing state... [id=terraform-template]%0Agithub_team_members.dev: Refreshing state... [id=7332815]%0Amodule.ih_8_repos["github-control"].github_branch_default.main: Refreshing state... [id=github-control]%0Amodule.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=github-control:GH_TOKEN]%0Amodule.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"]: Refreshing state... [id=github-control:akuzminsky]%0Amodule.ih_8_repos["github-control"].github_branch_protection.main: Refreshing state... [id=BPR_kwDOI2vu7M4CAici]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-github-control-state-polished-lioness]%0Adata.aws_secretsmanager_secrets.gh_secrets: Reading...%0Adata.aws_ssm_parameter.gh_secrets_namespace: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-trust: Read complete after 0s [id=2229426295]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-github-control-github]%0Adata.aws_secretsmanager_secrets.gh_secrets: Read complete after 0s [id=us-west-1]%0Amodule.ih_tf_template.github_team_repository.dev[0]: Refreshing state... [id=7332815:terraform-template]%0Adata.aws_ssm_parameter.gh_secrets_namespace: Read complete after 0s [id=gh_secrets_namespace]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Reading...%0Agithub_actions_variable.role_github: Refreshing state... [id=github-control:role_github]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=262017685]%0Aaws_secretsmanager_secret.codacy_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.admin-trust: Read complete after 0s [id=91398067]%0Aaws_secretsmanager_secret.pypi_api_token: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-github-control-state-manager]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-github-control-admin]%0Agithub_actions_variable.dynamodb_lock_table_name: Refreshing state... [id=github-control:dynamodb_lock_table_name]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-control-state]%0Agithub_actions_variable.role_admin: Refreshing state... [id=github-control:role_admin]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Reading...%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Agithub_actions_variable.role_state_manager: Refreshing state... [id=github-control:role_state_manager]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2246898652]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-github-control-github20231016152934873800000001]%0Adata.aws_secretsmanager_secret_version.pypi_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__PYPI_API_TOKEN-5N8UtG|AWSCURRENT]%0Adata.aws_secretsmanager_secret_version.codacy_api_token: Read complete after 0s [id=arn:aws:secretsmanager:us-west-1:303467602807:secret:_github_control__CODACY_PROJECT_TOKEN-fhlOS2|AWSCURRENT]%0Amodule.repos["infrahouse-com"].github_repository.repo: Refreshing state... [id=infrahouse-com]%0Amodule.repos["terraform-aws-ci-cd"].github_repository.repo: Refreshing state... [id=terraform-aws-ci-cd]%0Amodule.repos["puppet-code"].github_repository.repo: Refreshing state... [id=puppet-code]%0Amodule.infrahouse8-github-control.module.gha-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.repos["terraform-aws-service-network"].github_repository.repo: Refreshing state... [id=terraform-aws-service-network]%0Amodule.repos["terraform-aws-state-manager"].github_repository.repo: Refreshing state... [id=terraform-aws-state-manager]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_repository.repo: Refreshing state... [id=terraform-aws-gh-identity-provider]%0Amodule.repos["terraform-aws-website-pod"].github_repository.repo: Refreshing state... [id=terraform-aws-website-pod]%0Amodule.repos["terraform-aws-cloud-init"].github_repository.repo: Refreshing state... [id=terraform-aws-cloud-init]%0Amodule.repos["terraform-aws-debian-repo"].github_repository.repo: Refreshing state... [id=terraform-aws-debian-repo]%0Amodule.repos["terraform-aws-gha-admin"].github_repository.repo: Refreshing state... [id=terraform-aws-gha-admin]%0Amodule.repos["terraform-aws-instance-profile"].github_repository.repo: Refreshing state... [id=terraform-aws-instance-profile]%0Amodule.repos["terraform-aws-jumphost"].github_repository.repo: Refreshing state... [id=terraform-aws-jumphost]%0Amodule.repos["aws-control"].github_repository.repo: Refreshing state... [id=aws-control]%0Amodule.repos["infrahouse-puppet-data"].github_repository.repo: Refreshing state... [id=infrahouse-puppet-data]%0Amodule.repos["terraform-aws-github-role"].github_repository.repo: Refreshing state... [id=terraform-aws-github-role]%0Amodule.repos["aws-control-303467602807"].github_repository.repo: Refreshing state... [id=aws-control-303467602807]%0Amodule.repos["infrahouse-website-infra"].github_repository.repo: Refreshing state... [id=infrahouse-website-infra]%0Amodule.repos["proxysql-sandbox"].github_repository.repo: Refreshing state... [id=proxysql-sandbox]%0Amodule.repos["cookiecutter-github-control"].github_repository.repo: Refreshing state... [id=cookiecutter-github-control]%0Amodule.repos["terraform-aws-state-bucket"].github_repository.repo: Refreshing state... [id=terraform-aws-state-bucket]%0Amodule.repos["aws-control-289256138624"].github_repository.repo: Refreshing state... [id=aws-control-289256138624]%0Amodule.repos["aws-control-493370826424"].github_repository.repo: Refreshing state... [id=aws-control-493370826424]%0Amodule.repos["infrahouse-toolkit"].github_repository.repo: Refreshing state... [id=infrahouse-toolkit]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-github-control-github-20231016152935026000000003]%0Amodule.infrahouse8-github-control.module.gha-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-github-control-admin-20231016152934892800000002]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-control-state]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-control-state]%0Amodule.infrahouse8-github-control.module.state-bucket.aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-control-state]%0Agithub_actions_variable.state_bucket: Refreshing state... [id=github-control:state_bucket]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3098380055]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=19153250]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-ro20231016152936860000000001]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-github-control-state-manager-rw20231016152936864600000002]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152936987100000003]%0Amodule.infrahouse8-github-control.module.gha-admin.module.state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-github-control-state-manager-20231016152937028600000004]%0Amodule.repos["proxysql-sandbox"].github_team_repository.dev: Refreshing state... [id=7332815:proxysql-sandbox]%0Amodule.repos["terraform-aws-github-role"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-github-role]%0Amodule.repos["infrahouse-com"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-com]%0Amodule.repos["infrahouse-puppet-data"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-puppet-data]%0Amodule.repos["aws-control"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control]%0Amodule.repos["infrahouse-toolkit"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-toolkit]%0Amodule.repos["cookiecutter-github-control"].github_team_repository.dev: Refreshing state... [id=7332815:cookiecutter-github-control]%0Amodule.repos["aws-control-289256138624"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-289256138624]%0Amodule.repos["terraform-aws-instance-profile"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-instance-profile]%0Amodule.repos["terraform-aws-debian-repo"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-debian-repo]%0Amodule.repos["infrahouse-website-infra"].github_team_repository.dev: Refreshing state... [id=7332815:infrahouse-website-infra]%0Amodule.repos["terraform-aws-website-pod"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-website-pod]%0Amodule.repos["aws-control-493370826424"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-493370826424]%0Amodule.repos["terraform-aws-ci-cd"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-ci-cd]%0Amodule.repos["terraform-aws-service-network"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-service-network]%0Amodule.repos["terraform-aws-jumphost"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-jumphost]%0Amodule.repos["terraform-aws-cloud-init"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-cloud-init]%0Amodule.repos["terraform-aws-state-bucket"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-bucket]%0Amodule.repos["puppet-code"].github_team_repository.dev: Refreshing state... [id=7332815:puppet-code]%0Amodule.repos["terraform-aws-state-manager"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-state-manager]%0Amodule.repos["aws-control-303467602807"].github_team_repository.dev: Refreshing state... [id=7332815:aws-control-303467602807]%0Amodule.repos["terraform-aws-gha-admin"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gha-admin]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_team_repository.dev: Refreshing state... [id=7332815:terraform-aws-gh-identity-provider]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["PYPI_API_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:PYPI_API_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["CODACY_PROJECT_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:CODACY_PROJECT_TOKEN]%0Amodule.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-cloud-init:GH_TOKEN]%0Amodule.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=puppet-code:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-toolkit:GH_TOKEN]%0Amodule.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gh-identity-provider:GH_TOKEN]%0Amodule.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=proxysql-sandbox:GH_TOKEN]%0Amodule.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-com:GH_TOKEN]%0Amodule.repos["terraform-aws-github-role"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-github-role:GH_TOKEN]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-289256138624:GH_TOKEN]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-303467602807:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-puppet-data"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-puppet-data:GH_TOKEN]%0Amodule.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-gha-admin:GH_TOKEN]%0Amodule.repos["infrahouse-toolkit"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-toolkit:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control:GH_TOKEN]%0Amodule.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-instance-profile:GH_TOKEN]%0Amodule.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-debian-repo:GH_TOKEN]%0Amodule.repos["aws-control-289256138624"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-289256138624:AWS_DEFAULT_REGION]%0Amodule.repos["infrahouse-com"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-com:AWS_DEFAULT_REGION]%0Amodule.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=cookiecutter-github-control:GH_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-website-infra:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-state-bucket"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-bucket:GH_TOKEN]%0Amodule.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-state-manager:GH_TOKEN]%0Amodule.repos["terraform-aws-ci-cd"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-ci-cd:GH_TOKEN]%0Amodule.repos["aws-control"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=aws-control-493370826424:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-303467602807:GH_TOKEN]%0Amodule.repos["puppet-code"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=puppet-code:AWS_DEFAULT_REGION]%0Amodule.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=aws-control-493370826424:GH_TOKEN]%0Amodule.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-service-network:GH_TOKEN]%0Amodule.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=infrahouse-website-infra:GH_TOKEN]%0Amodule.repos["infrahouse-puppet-data"].github_actions_secret.secret["AWS_DEFAULT_REGION"]: Refreshing state... [id=infrahouse-puppet-data:AWS_DEFAULT_REGION]%0Amodule.repos["terraform-aws-jumphost"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-jumphost:GH_TOKEN]%0Amodule.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"]: Refreshing state... [id=terraform-aws-website-pod:GH_TOKEN]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.repos["terraform-aws-ecs"].github_actions_secret.secret["GH_TOKEN"] will be created%0A  + resource "github_actions_secret" "secret" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "terraform-aws-ecs"%0A      + secret_name     = "GH_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # module.repos["terraform-aws-ecs"].github_repository.repo will be created%0A  + resource "github_repository" "repo" {%0A      + allow_auto_merge            = false%0A      + allow_merge_commit          = true%0A      + allow_rebase_merge          = true%0A      + allow_squash_merge          = true%0A      + archived                    = false%0A      + default_branch              = (known after apply)%0A      + delete_branch_on_merge      = false%0A      + description                 = "Module that runs service in ECS"%0A      + etag                        = (known after apply)%0A      + full_name                   = (known after apply)%0A      + git_clone_url               = (known after apply)%0A      + has_issues                  = true%0A      + html_url                    = (known after apply)%0A      + http_clone_url              = (known after apply)%0A      + id                          = (known after apply)%0A      + merge_commit_message        = "PR_TITLE"%0A      + merge_commit_title          = "MERGE_MESSAGE"%0A      + name                        = "terraform-aws-ecs"%0A      + node_id                     = (known after apply)%0A      + primary_language            = (known after apply)%0A      + private                     = (known after apply)%0A      + repo_id                     = (known after apply)%0A      + squash_merge_commit_message = "COMMIT_MESSAGES"%0A      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"%0A      + ssh_clone_url               = (known after apply)%0A      + svn_url                     = (known after apply)%0A      + topics                      = (known after apply)%0A      + visibility                  = "public"%0A    }%0A%0A  # module.repos["terraform-aws-ecs"].github_team_repository.dev will be created%0A  + resource "github_team_repository" "dev" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "push"%0A      + repository = "terraform-aws-ecs"%0A      + team_id    = "7332815"%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAic3Rkb3V0IjogIltjb21tYW5kXS9ob21lL3J1bm5lci93b3JrL190ZW1wLzdhMjMwMGE5LTA4N2YtNGQ4Ni1iZmNkLWU3NzFjNjgyOGM2MC90ZXJyYWZvcm0tYmluIHBsYW4gLW5vLWNvbG9yIC0tb3V0PXRmLnBsYW5cbmRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkaW5nLi4uXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLnN0YXRlLWJ1Y2tldC5yYW5kb21fcGV0LnN1ZmZpeDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZS1wb2xpc2hlZC1saW9uZXNzXVxuZGF0YS5leHRlcm5hbC5lbnY6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPS1dXG5tb2R1bGUuaWg4X3RmX3RlbXBsYXRlLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS10ZW1wbGF0ZV1cbm1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdXG5naXRodWJfbWVtYmVyc2hpcC5pbmZyYWhvdXNlW1wiYWt1em1pbnNreVwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZTpha3V6bWluc2t5XVxuZ2l0aHViX3RlYW0uZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1XVxuZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdXG5tb2R1bGUuaWhfdGZfdGVtcGxhdGUuZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXVxuZ2l0aHViX3RlYW1fbWVtYmVycy5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdXG5tb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF1cbm1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpHSF9UT0tFTl1cbm1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnlfY29sbGFib3JhdG9yLmNvbGxhYm9yYXRvcnNbXCJha3V6bWluc2t5XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpha3V6bWluc2t5XVxubW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9JMnZ1N000Q0FpY2ldXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1jb250cm9sLXN0YXRlLXBvbGlzaGVkLWxpb25lc3NdXG5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRzLmdoX3NlY3JldHM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlYWRpbmcuLi5cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi5cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWRpbmcuLi5cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkaW5nLi4uXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi10cnVzdDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjIyOTQyNjI5NV1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLWdpdGh1Yl1cbmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldHMuZ2hfc2VjcmV0czogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXVxubW9kdWxlLmloX3RmX3RlbXBsYXRlLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS10ZW1wbGF0ZV1cbmRhdGEuYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWdoX3NlY3JldHNfbmFtZXNwYWNlXVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi10cnVzdDogUmVhZGluZy4uLlxuZ2l0aHViX2FjdGlvbnNfdmFyaWFibGUucm9sZV9naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOnJvbGVfZ2l0aHViXVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNjIwMTc2ODVdXG5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LmNvZGFjeV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19DT0RBQ1lfUFJPSkVDVF9UT0tFTi1maGxPUzJdXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD05MTM5ODA2N11cbmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQucHlwaV9hcGlfdG9rZW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi01TjhVdEddXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtc3RhdGUtbWFuYWdlcl1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtYWRtaW5dXG5naXRodWJfYWN0aW9uc192YXJpYWJsZS5keW5hbW9kYl9sb2NrX3RhYmxlX25hbWU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOmR5bmFtb2RiX2xvY2tfdGFibGVfbmFtZV1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuc3RhdGUtYnVja2V0LmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1jb250cm9sLXN0YXRlXVxuZ2l0aHViX2FjdGlvbnNfdmFyaWFibGUucm9sZV9hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6cm9sZV9hZG1pbl1cbmRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLnB5cGlfYXBpX3Rva2VuOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5jb2RhY3lfYXBpX3Rva2VuOiBSZWFkaW5nLi4uXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxuZ2l0aHViX2FjdGlvbnNfdmFyaWFibGUucm9sZV9zdGF0ZV9tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpyb2xlX3N0YXRlX21hbmFnZXJdXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjI0Njg5ODY1Ml1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvaWgtdGYtZ2l0aHViLWNvbnRyb2wtZ2l0aHViMjAyMzEwMTYxNTI5MzQ4NzM4MDAwMDAwMDFdXG5kYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6MzAzNDY3NjAyODA3OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX1BZUElfQVBJX1RPS0VOLTVOOFV0R3xBV1NDVVJSRU5UXVxuZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24uY29kYWN5X2FwaV90b2tlbjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6MzAzNDY3NjAyODA3OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX0NPREFDWV9QUk9KRUNUX1RPS0VOLWZobE9TMnxBV1NDVVJSRU5UXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb21dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNpLWNkXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtY2ktY2RdXG5tb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZV1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya11cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlclwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naGEtYWRtaW5dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1qdW1waG9zdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWp1bXBob3N0XVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2xdXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXB1cHBldC1kYXRhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtcHVwcGV0LWRhdGFdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdpdGh1Yi1yb2xlXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2l0aHViLXJvbGVdXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cbm1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHJveHlzcWwtc2FuZGJveF1cbm1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldF1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdF1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLWdpdGh1Yi0yMDIzMTAxNjE1MjkzNTAyNjAwMDAwMDAwM11cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtYWRtaW4tMjAyMzEwMTYxNTI5MzQ4OTI4MDAwMDAwMDJdXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZV1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuc3RhdGUtYnVja2V0LmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGVdXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLnN0YXRlLWJ1Y2tldC5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZV1cbmdpdGh1Yl9hY3Rpb25zX3ZhcmlhYmxlLnN0YXRlX2J1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6c3RhdGVfYnVja2V0XVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZGluZy4uLlxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzA5ODM4MDA1NV1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWRpbmcuLi5cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE5MTUzMjUwXVxubW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWdpdGh1Yi1jb250cm9sLXN0YXRlLW1hbmFnZXItcm8yMDIzMTAxNjE1MjkzNjg2MDAwMDAwMDAwMV1cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3J3OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1naXRodWItY29udHJvbC1zdGF0ZS1tYW5hZ2VyLXJ3MjAyMzEwMTYxNTI5MzY4NjQ2MDAwMDAwMDJdXG5tb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtc3RhdGUtbWFuYWdlci0yMDIzMTAxNjE1MjkzNjk4NzEwMDAwMDAwM11cbm1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJ3WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbC1zdGF0ZS1tYW5hZ2VyLTIwMjMxMDE2MTUyOTM3MDI4NjAwMDAwMDA0XVxubW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpwcm94eXNxbC1zYW5kYm94XVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naXRodWItcm9sZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWdpdGh1Yi1yb2xlXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS1jb21dXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXB1cHBldC1kYXRhXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtcHVwcGV0LWRhdGFdXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbF1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTppbmZyYWhvdXNlLXRvb2xraXRdXG5tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sLTI4OTI1NjEzODYyNF1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9dXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtY2ktY2RcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1jaS1jZF1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3Mtc2VydmljZS1uZXR3b3JrXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1qdW1waG9zdFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWp1bXBob3N0XVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdF1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0XVxubW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6cHVwcGV0LWNvZGVdXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlclwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJQWVBJX0FQSV9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OlBZUElfQVBJX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJDT0RBQ1lfUFJPSkVDVF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OkNPREFDWV9QUk9KRUNUX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wdXBwZXQtY29kZTpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wicHJveHlzcWwtc2FuZGJveFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXByb3h5c3FsLXNhbmRib3g6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWNvbVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtY29tOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naXRodWItcm9sZVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2l0aHViLXJvbGU6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQ6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3OkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtcHVwcGV0LWRhdGFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXB1cHBldC1kYXRhOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoYS1hZG1pbjpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZTpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvOkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTI4OTI1NjEzODYyNDpBV1NfREVGQVVMVF9SRUdJT05dXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLWNvbVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWNvbTpBV1NfREVGQVVMVF9SRUdJT05dXG5tb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1jb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2w6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1zdGF0ZS1idWNrZXQ6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXI6R0hfVE9LRU5dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNpLWNkXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jaS1jZDpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sOkFXU19ERUZBVUxUX1JFR0lPTl1cbm1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQ6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1wicHVwcGV0LWNvZGVcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHVwcGV0LWNvZGU6QVdTX0RFRkFVTFRfUkVHSU9OXVxubW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0OkdIX1RPS0VOXVxubW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29yazpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYTpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtcHVwcGV0LWRhdGFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1wdXBwZXQtZGF0YTpBV1NfREVGQVVMVF9SRUdJT05dXG5tb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWp1bXBob3N0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1qdW1waG9zdDpHSF9UT0tFTl1cbm1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kOkdIX1RPS0VOXVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1lY3NcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiZ2l0aHViX2FjdGlvbnNfc2VjcmV0XCIgXCJzZWNyZXRcIiB7XG4gICAgICArIGNyZWF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwbGFpbnRleHRfdmFsdWUgPSAoc2Vuc2l0aXZlIHZhbHVlKVxuICAgICAgKyByZXBvc2l0b3J5ICAgICAgPSBcInRlcnJhZm9ybS1hd3MtZWNzXCJcbiAgICAgICsgc2VjcmV0X25hbWUgICAgID0gXCJHSF9UT0tFTlwiXG4gICAgICArIHVwZGF0ZWRfYXQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWVjc1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiZ2l0aHViX3JlcG9zaXRvcnlcIiBcInJlcG9cIiB7XG4gICAgICArIGFsbG93X2F1dG9fbWVyZ2UgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGFsbG93X21lcmdlX2NvbW1pdCAgICAgICAgICA9IHRydWVcbiAgICAgICsgYWxsb3dfcmViYXNlX21lcmdlICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBhbGxvd19zcXVhc2hfbWVyZ2UgICAgICAgICAgPSB0cnVlXG4gICAgICArIGFyY2hpdmVkICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGRlZmF1bHRfYnJhbmNoICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVsZXRlX2JyYW5jaF9vbl9tZXJnZSAgICAgID0gZmFsc2VcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgICAgICAgID0gXCJNb2R1bGUgdGhhdCBydW5zIHNlcnZpY2UgaW4gRUNTXCJcbiAgICAgICsgZXRhZyAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBmdWxsX25hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGdpdF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaGFzX2lzc3VlcyAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBodG1sX3VybCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGh0dHBfY2xvbmVfdXJsICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtZXJnZV9jb21taXRfbWVzc2FnZSAgICAgICAgPSBcIlBSX1RJVExFXCJcbiAgICAgICsgbWVyZ2VfY29tbWl0X3RpdGxlICAgICAgICAgID0gXCJNRVJHRV9NRVNTQUdFXCJcbiAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ0ZXJyYWZvcm0tYXdzLWVjc1wiXG4gICAgICArIG5vZGVfaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpbWFyeV9sYW5ndWFnZSAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcml2YXRlICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlcG9faWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3F1YXNoX21lcmdlX2NvbW1pdF9tZXNzYWdlID0gXCJDT01NSVRfTUVTU0FHRVNcIlxuICAgICAgKyBzcXVhc2hfbWVyZ2VfY29tbWl0X3RpdGxlICAgPSBcIkNPTU1JVF9PUl9QUl9USVRMRVwiXG4gICAgICArIHNzaF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3ZuX3VybCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0b3BpY3MgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHZpc2liaWxpdHkgICAgICAgICAgICAgICAgICA9IFwicHVibGljXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWVjc1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldiB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImdpdGh1Yl90ZWFtX3JlcG9zaXRvcnlcIiBcImRldlwiIHtcbiAgICAgICsgZXRhZyAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGVybWlzc2lvbiA9IFwicHVzaFwiXG4gICAgICArIHJlcG9zaXRvcnkgPSBcInRlcnJhZm9ybS1hd3MtZWNzXCJcbiAgICAgICsgdGVhbV9pZCAgICA9IFwiNzMzMjgxNVwiXG4gICAgfVxuXG5QbGFuOiAzIHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS5cblxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuOjpkZWJ1Zzo6VGVycmFmb3JtIGV4aXRlZCB3aXRoIGNvZGUgMC5cbjo6ZGVidWc6OnN0ZG91dDogZGF0YS5leHRlcm5hbC5lbnY6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLnN0YXRlLWJ1Y2tldC5yYW5kb21fcGV0LnN1ZmZpeDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZS1wb2xpc2hlZC1saW9uZXNzXSUwQWRhdGEuZXh0ZXJuYWwuZW52OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0tXSUwQW1vZHVsZS5paDhfdGZfdGVtcGxhdGUuZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLXRlbXBsYXRlXSUwQW1vZHVsZS5paF84X3JlcG9zW1wiZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2xdJTBBZ2l0aHViX21lbWJlcnNoaXAuaW5mcmFob3VzZVtcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2U6YWt1em1pbnNreV0lMEFnaXRodWJfdGVhbS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTVdJTBBZ2l0aHViX29yZ2FuaXphdGlvbl9zZXR0aW5ncy5pbmZyYWhvdXNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0xMjE5ODQyNjNdJTBBbW9kdWxlLmloX3RmX3RlbXBsYXRlLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS10ZW1wbGF0ZV0lMEFnaXRodWJfdGVhbV9tZW1iZXJzLmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNV0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9icmFuY2hfZGVmYXVsdC5tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbF0lMEFtb2R1bGUuaWhfOF9yZXBvc1tcImdpdGh1Yi1jb250cm9sXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6R0hfVE9LRU5dJTBBbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfcmVwb3NpdG9yeV9jb2xsYWJvcmF0b3IuY29sbGFib3JhdG9yc1tcImFrdXptaW5za3lcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdpdGh1Yi1jb250cm9sOmFrdXptaW5za3ldJTBBbW9kdWxlLmloXzhfcmVwb3NbXCJnaXRodWItY29udHJvbFwiXS5naXRodWJfYnJhbmNoX3Byb3RlY3Rpb24ubWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QlBSX2t3RE9JMnZ1N000Q0FpY2ldJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5zdGF0ZS1idWNrZXQuYXdzX2R5bmFtb2RiX3RhYmxlLnRlcnJhZm9ybV9sb2NrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItY29udHJvbC1zdGF0ZS1wb2xpc2hlZC1saW9uZXNzXSUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldHMuZ2hfc2VjcmV0czogUmVhZGluZy4uLiUwQWRhdGEuYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4uZGF0YS5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi10cnVzdDogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjI5NDI2Mjk1XSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLWdpdGh1Yl0lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRzLmdoX3NlY3JldHM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUuaWhfdGZfdGVtcGxhdGUuZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXZbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLXRlbXBsYXRlXSUwQWRhdGEuYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWdoX3NlY3JldHNfbmFtZXNwYWNlXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tdHJ1c3Q6IFJlYWRpbmcuLi4lMEFnaXRodWJfYWN0aW9uc192YXJpYWJsZS5yb2xlX2dpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6cm9sZV9naXRodWJdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjYyMDE3Njg1XSUwQWF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXQuY29kYWN5X2FwaV90b2tlbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy13ZXN0LTE6MzAzNDY3NjAyODA3OnNlY3JldDpfZ2l0aHViX2NvbnRyb2xfX0NPREFDWV9QUk9KRUNUX1RPS0VOLWZobE9TMl0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLXRydXN0OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD05MTM5ODA2N10lMEFhd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0LnB5cGlfYXBpX3Rva2VuOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fUFlQSV9BUElfVE9LRU4tNU44VXRHXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbC1zdGF0ZS1tYW5hZ2VyXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtYWRtaW5dJTBBZ2l0aHViX2FjdGlvbnNfdmFyaWFibGUuZHluYW1vZGJfbG9ja190YWJsZV9uYW1lOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpkeW5hbW9kYl9sb2NrX3RhYmxlX25hbWVdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5zdGF0ZS1idWNrZXQuYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGVdJTBBZ2l0aHViX2FjdGlvbnNfdmFyaWFibGUucm9sZV9hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6cm9sZV9hZG1pbl0lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5weXBpX2FwaV90b2tlbjogUmVhZGluZy4uLiUwQWRhdGEuYXdzX3NlY3JldHNtYW5hZ2VyX3NlY3JldF92ZXJzaW9uLmNvZGFjeV9hcGlfdG9rZW46IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQWdpdGh1Yl9hY3Rpb25zX3ZhcmlhYmxlLnJvbGVfc3RhdGVfbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2l0aHViLWNvbnRyb2w6cm9sZV9zdGF0ZV9tYW5hZ2VyXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjQ2ODk4NjUyXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvaWgtdGYtZ2l0aHViLWNvbnRyb2wtZ2l0aHViMjAyMzEwMTYxNTI5MzQ4NzM4MDAwMDAwMDFdJTBBZGF0YS5hd3Nfc2VjcmV0c21hbmFnZXJfc2VjcmV0X3ZlcnNpb24ucHlwaV9hcGlfdG9rZW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6c2VjcmV0c21hbmFnZXI6dXMtd2VzdC0xOjMwMzQ2NzYwMjgwNzpzZWNyZXQ6X2dpdGh1Yl9jb250cm9sX19QWVBJX0FQSV9UT0tFTi01TjhVdEd8QVdTQ1VSUkVOVF0lMEFkYXRhLmF3c19zZWNyZXRzbWFuYWdlcl9zZWNyZXRfdmVyc2lvbi5jb2RhY3lfYXBpX3Rva2VuOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTozMDM0Njc2MDI4MDc6c2VjcmV0Ol9naXRodWJfY29udHJvbF9fQ09EQUNZX1BST0pFQ1RfVE9LRU4tZmhsT1MyfEFXU0NVUlJFTlRdJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb21dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jaS1jZFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWNpLWNkXSUwQW1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB1cHBldC1jb2RlXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlcl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWNsb3VkLWluaXRdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWRlYmlhbi1yZXBvXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtaW5zdGFuY2UtcHJvZmlsZVwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1qdW1waG9zdFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWp1bXBob3N0XSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtcHVwcGV0LWRhdGFcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1wdXBwZXQtZGF0YV0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWdpdGh1Yi1yb2xlXCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2l0aHViLXJvbGVdJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN10lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXSUwQW1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHJveHlzcWwtc2FuZGJveF0lMEFtb2R1bGUucmVwb3NbXCJjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Y29va2llY3V0dGVyLWdpdGh1Yi1jb250cm9sXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0XSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5naXRodWJfcmVwb3NpdG9yeS5yZXBvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9yZXBvc2l0b3J5LnJlcG86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0XSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLWdpdGh1Yi0yMDIzMTAxNjE1MjkzNTAyNjAwMDAwMDAwM10lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLWFkbWluLTIwMjMxMDE2MTUyOTM0ODkyODAwMDAwMDAyXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuc3RhdGUtYnVja2V0LmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1jb250cm9sLXN0YXRlXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuc3RhdGUtYnVja2V0LmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGVdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5zdGF0ZS1idWNrZXQuYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGVdJTBBZ2l0aHViX2FjdGlvbnNfdmFyaWFibGUuc3RhdGVfYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naXRodWItY29udHJvbDpzdGF0ZV9idWNrZXRdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMwOTgzODAwNTVdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE5MTUzMjUwXSUwQW1vZHVsZS5pbmZyYWhvdXNlOC1naXRodWItY29udHJvbC5tb2R1bGUuZ2hhLWFkbWluLm1vZHVsZS5zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1naXRodWItY29udHJvbC1zdGF0ZS1tYW5hZ2VyLXJvMjAyMzEwMTYxNTI5MzY4NjAwMDAwMDAwMDFdJTBBbW9kdWxlLmluZnJhaG91c2U4LWdpdGh1Yi1jb250cm9sLm1vZHVsZS5naGEtYWRtaW4ubW9kdWxlLnN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWdpdGh1Yi1jb250cm9sLXN0YXRlLW1hbmFnZXItcncyMDIzMTAxNjE1MjkzNjg2NDYwMDAwMDAwMl0lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtc3RhdGUtbWFuYWdlci0yMDIzMTAxNjE1MjkzNjk4NzEwMDAwMDAwM10lMEFtb2R1bGUuaW5mcmFob3VzZTgtZ2l0aHViLWNvbnRyb2wubW9kdWxlLmdoYS1hZG1pbi5tb2R1bGUuc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1yd1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtc3RhdGUtbWFuYWdlci0yMDIzMTAxNjE1MjkzNzAyODYwMDAwMDAwNF0lMEFtb2R1bGUucmVwb3NbXCJwcm94eXNxbC1zYW5kYm94XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnByb3h5c3FsLXNhbmRib3hdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naXRodWItcm9sZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWdpdGh1Yi1yb2xlXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmluZnJhaG91c2UtY29tXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtcHVwcGV0LWRhdGFcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS1wdXBwZXQtZGF0YV0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbF0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS10b29sa2l0XSUwQW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpjb29raWVjdXR0ZXItZ2l0aHViLWNvbnRyb2xdJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OmF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1pbnN0YW5jZS1wcm9maWxlXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG9cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb10lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtd2Vic2l0ZS1wb2RcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZF0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6YXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtY2ktY2RcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1jaS1jZF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29ya10lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWp1bXBob3N0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtanVtcGhvc3RdJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl90ZWFtX3JlcG9zaXRvcnkuZGV2OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD03MzMyODE1OnRlcnJhZm9ybS1hd3MtY2xvdWQtaW5pdF0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldFwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldF0lMEFtb2R1bGUucmVwb3NbXCJwdXBwZXQtY29kZVwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTpwdXBwZXQtY29kZV0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLW1hbmFnZXJcIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1zdGF0ZS1tYW5hZ2VyXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTphd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIl0uZ2l0aHViX3RlYW1fcmVwb3NpdG9yeS5kZXY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTczMzI4MTU6dGVycmFmb3JtLWF3cy1naGEtYWRtaW5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naC1pZGVudGl0eS1wcm92aWRlclwiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzMzMjgxNTp0ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtdG9vbGtpdFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiUFlQSV9BUElfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpQWVBJX0FQSV9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXRvb2xraXRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkNPREFDWV9QUk9KRUNUX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRvb2xraXQ6Q09EQUNZX1BST0pFQ1RfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1jbG91ZC1pbml0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jbG91ZC1pbml0OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cHVwcGV0LWNvZGU6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10b29sa2l0OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2gtaWRlbnRpdHktcHJvdmlkZXJcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWdoLWlkZW50aXR5LXByb3ZpZGVyOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInByb3h5c3FsLXNhbmRib3hcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1wcm94eXNxbC1zYW5kYm94OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtY29tXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb206R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1naXRodWItcm9sZVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZ2l0aHViLXJvbGU6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcImF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDc6QVdTX0RFRkFVTFRfUkVHSU9OXSUwQW1vZHVsZS5yZXBvc1tcImluZnJhaG91c2UtcHVwcGV0LWRhdGFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXB1cHBldC1kYXRhOkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1naGEtYWRtaW46R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS10b29sa2l0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdG9vbGtpdDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2xcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGVcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLWluc3RhbmNlLXByb2ZpbGU6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1kZWJpYW4tcmVwb1wiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3MtZGViaWFuLXJlcG86R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTI4OTI1NjEzODYyNDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1jb21cIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1jb206QVdTX0RFRkFVTFRfUkVHSU9OXSUwQW1vZHVsZS5yZXBvc1tcImNvb2tpZWN1dHRlci1naXRodWItY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWNvb2tpZWN1dHRlci1naXRodWItY29udHJvbDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkFXU19ERUZBVUxUX1JFR0lPTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhOkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc3RhdGUtYnVja2V0OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlclwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiR0hfVE9LRU5cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcnJhZm9ybS1hd3Mtc3RhdGUtbWFuYWdlcjpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWNpLWNkXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1jaS1jZDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbFwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNDpBV1NfREVGQVVMVF9SRUdJT05dJTBBbW9kdWxlLnJlcG9zW1wiYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3OkdIX1RPS0VOXSUwQW1vZHVsZS5yZXBvc1tcInB1cHBldC1jb2RlXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJBV1NfREVGQVVMVF9SRUdJT05cIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXB1cHBldC1jb2RlOkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJhd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQ6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1zZXJ2aWNlLW5ldHdvcmtcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJyYWZvcm0tYXdzLXNlcnZpY2UtbmV0d29yazpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmE6R0hfVE9LRU5dJTBBbW9kdWxlLnJlcG9zW1wiaW5mcmFob3VzZS1wdXBwZXQtZGF0YVwiXS5naXRodWJfYWN0aW9uc19zZWNyZXQuc2VjcmV0W1wiQVdTX0RFRkFVTFRfUkVHSU9OXCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXB1cHBldC1kYXRhOkFXU19ERUZBVUxUX1JFR0lPTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWp1bXBob3N0XCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy1qdW1waG9zdDpHSF9UT0tFTl0lMEFtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLXdlYnNpdGUtcG9kXCJdLmdpdGh1Yl9hY3Rpb25zX3NlY3JldC5zZWNyZXRbXCJHSF9UT0tFTlwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVycmFmb3JtLWF3cy13ZWJzaXRlLXBvZDpHSF9UT0tFTl0lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgKyBjcmVhdGUlMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1lY3NcIl0uZ2l0aHViX2FjdGlvbnNfc2VjcmV0LnNlY3JldFtcIkdIX1RPS0VOXCJdIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImdpdGh1Yl9hY3Rpb25zX3NlY3JldFwiIFwic2VjcmV0XCIgeyUwQSAgICAgICsgY3JlYXRlZF9hdCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcGxhaW50ZXh0X3ZhbHVlID0gKHNlbnNpdGl2ZSB2YWx1ZSklMEEgICAgICArIHJlcG9zaXRvcnkgICAgICA9IFwidGVycmFmb3JtLWF3cy1lY3NcIiUwQSAgICAgICsgc2VjcmV0X25hbWUgICAgID0gXCJHSF9UT0tFTlwiJTBBICAgICAgKyB1cGRhdGVkX2F0ICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLnJlcG9zW1widGVycmFmb3JtLWF3cy1lY3NcIl0uZ2l0aHViX3JlcG9zaXRvcnkucmVwbyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJnaXRodWJfcmVwb3NpdG9yeVwiIFwicmVwb1wiIHslMEEgICAgICArIGFsbG93X2F1dG9fbWVyZ2UgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBhbGxvd19tZXJnZV9jb21taXQgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBhbGxvd19yZWJhc2VfbWVyZ2UgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBhbGxvd19zcXVhc2hfbWVyZ2UgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBhcmNoaXZlZCAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgZGVmYXVsdF9icmFuY2ggICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVsZXRlX2JyYW5jaF9vbl9tZXJnZSAgICAgID0gZmFsc2UlMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgICAgICA9IFwiTW9kdWxlIHRoYXQgcnVucyBzZXJ2aWNlIGluIEVDU1wiJTBBICAgICAgKyBldGFnICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBmdWxsX25hbWUgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBnaXRfY2xvbmVfdXJsICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBoYXNfaXNzdWVzICAgICAgICAgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBodG1sX3VybCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBodHRwX2Nsb25lX3VybCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtZXJnZV9jb21taXRfbWVzc2FnZSAgICAgICAgPSBcIlBSX1RJVExFXCIlMEEgICAgICArIG1lcmdlX2NvbW1pdF90aXRsZSAgICAgICAgICA9IFwiTUVSR0VfTUVTU0FHRVwiJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgICAgICAgPSBcInRlcnJhZm9ybS1hd3MtZWNzXCIlMEEgICAgICArIG5vZGVfaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHByaW1hcnlfbGFuZ3VhZ2UgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHByaXZhdGUgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJlcG9faWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfbWVzc2FnZSA9IFwiQ09NTUlUX01FU1NBR0VTXCIlMEEgICAgICArIHNxdWFzaF9tZXJnZV9jb21taXRfdGl0bGUgICA9IFwiQ09NTUlUX09SX1BSX1RJVExFXCIlMEEgICAgICArIHNzaF9jbG9uZV91cmwgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN2bl91cmwgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRvcGljcyAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHZpc2liaWxpdHkgICAgICAgICAgICAgICAgICA9IFwicHVibGljXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUucmVwb3NbXCJ0ZXJyYWZvcm0tYXdzLWVjc1wiXS5naXRodWJfdGVhbV9yZXBvc2l0b3J5LmRldiB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJnaXRodWJfdGVhbV9yZXBvc2l0b3J5XCIgXCJkZXZcIiB7JTBBICAgICAgKyBldGFnICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBlcm1pc3Npb24gPSBcInB1c2hcIiUwQSAgICAgICsgcmVwb3NpdG9yeSA9IFwidGVycmFmb3JtLWF3cy1lY3NcIiUwQSAgICAgICsgdGVhbV9pZCAgICA9IFwiNzMzMjgxNVwiJTBBICAgIH0lMEElMEFQbGFuOiAzIHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogMywgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19```
</p></details>